// Основни операции
//  push_back() – добавя елемент в края
//  pop_back() – премахва последния елемент
//  insert() – вмъква елемент на дадена позиция
//  erase() – изтрива елемент

// Достъп до елементи
//  operator[] – достъп без проверка
//  at() – достъп с проверка
//  front() – първи елемент
//  back() – последен елемент
//  data() – pointer към първия елемент

// Размер и капацитет
//  size() – брой елементи
//  capacity() – заделена памет
//  resize() – променя броя елементи
//  reserve() – заделя памет предварително
//  empty() – дали е празен

// Модификация
//  clear() – изтрива всички елементи
//  assign() – заменя съдържанието
//  swap() – разменя съдържание с друг vector

// Итерация
//  begin(), end()
//  rbegin(), rend()

#include "SimpleVector.h"
